site_files_my_bkp/app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("slug", "cached_tag_list", "body_html", "created_at", "title", "body", "approved_comments_count", "updated_at", "published_at", "edited_at", "active") VALUES('post-01', 'a b c', '<p>aaa</p>', '2010-11-08 21:27:10', 'Post 01', 'aaa', 0, '2010-11-08 21:27:10', '2010-11-08 21:27:10', '2010-11-08 21:27:10', 't')

  def find_post
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)