site_files_my_bkp/app/controllers/user_sessions_controller.rb

  def create
    if params[:user_session] && !params[:user_session][:openid_identifier].blank?
      @user_session = UserSession.new({:openid_identifier => params[:user_session][:openid_identifier]})
    else
      @user_session = UserSession.new(params[:user_session])
    end
    @user_session.save do |result|
      if result
        session[:language] = UserSession.find.user.language
---
SELECT * FROM "users" WHERE (LOWER("users".email) = 'zamith.28@gmail.com') LIMIT 1